<h1><?= $headTitle ?></h1>
<p>
    Меня зовут Александр Голубев.<br>
    Мне <?= date_diff(date_create(), date_create('1987-07-23'))->format('%Y лет'); ?>.<br>
    В 2014 году я сменил скучную карьеру в банке на карьеру программиста.
    <br>Самостоятельно изучал основы программирования.
    <br>Затем я получил приглашение на стажировку в МТРК "МИР" в группу WEB-разработки.
    <br>Под руководством ведущего разработчика освоил базовые навыки разработки и был повышен до junior`а.
    <br>Через несколько месяцев принял решение, что нужно повышать свой уровень и поднять планку сложности решаемых задач.
    <br>
    <br>На новом месте работы меня поджидал бешеный ритм разработки и развития интернет-проектов компании, а также высокие требования к уровню и объёму знаний.
    <br>
<ul>
    За время работы над проектами я освоил в необходимом для эффективной разработки объёме следующие технологии и инструменты:
    <li>LAMP</li>
    <li>ООП и MVC</li>
    <li>JavaScript и jQuery</li>
    <li>Ajax</li>
    <li>HTML</li>
    <li>CSS (в том числе Less и Sass)</li>
    <li>Bootstrap</li>
    <li>GIT (в т.ч. через терминал)</li>
    <li>Redis</li>
    <li>supervisor</li>
    <li>регулярные выражения</li>
    <li>Grunt и Gulp</li>
    <li>MySQL Workbench</li>
    <li>Zen Coding</li>
    <li>другие инструменты, технологии и приложения, необходимые для разработки.</li>
</ul>
Любимая среда разработки - NetBeans 8.2.<br><br>
<ul>
    Коротко о моих навыках:
    <li>умею работать через терминал (подключиться к серверу, посмотреть логи, перезапустить службу, отредактировать что-нибудь в vim, выйти из vim, посмотреть нагрузку на сервер, поработать в MC с другим сервером и т.д.</li>
    <li>могу написать запрос в MySQL средней сложности, используя встроенные функции и операторы языка, не боюсь оператора JOIN</li>
    <li>могу, но не очень люблю, верстать</li>
    <li>понимаю разницу между таблицами MyISAM и InnoDB, знаю что такое внешние ключи, могу провесить индексы туда, где это необходимо</li>
    <li>могу добавить виртуальный хост и включить его в apache</li>
    <li>знаю, как купить домен,арендовать виртуальный сервер, прописать DNS и запустить приложение на сервере</li>
    <li>читаю чужой код, понимаю рантайм кода, могу найти ошибку и пофиксить</li>
    <li>использую отдельные ветки в git под отдельные задачи</li>
    <li>работал с фреймворком Phalcon</li>
    <li>слышал про PSR, работаю над собой, чтобы ему следовать</li>
    <li>пользуюсь регулярными выражениями</li>
    <li>умею гуглить</li>
    <li>читаю на английском техническую документацию в объёме, необходимом для понимания написанного</li>
    <li>открыт для помощи начинающим программистам, думаю, что умею объяснять</li>
    <li>самым глупым вопросом считаю не заданный вопрос</li>
    <li>постоянно учусь сам</li>
    <li>применяю свои навыки и знания для решения прикладных задач</li>
    <li>читаю книги о программировании и смежных темах</li>
    <li>постоянно недоволен своим кодом, написанным некоторое время назад.</li>
</ul>
</p>

