<h1><?= $headTitle ?></h1>
<p>
    Проект создан для описания навыков автора в области web-разработки.<br>
    Данный проект не претендует на 100%-ю правильность описания процессов создания сайтов, а лишь помогает разобраться с использованием инструментов, в том числе самому автору.<br>
    Проект создан при финансовой поддержке автора и держится на голом энтузиазме!<br>
    Здесь можно будет найти шпаргалки, куски кода и прочие советы.
<ul>
    Области, которые охватывает проект:
    <li>PHP</li>
    <li>HTML</li>
    <li>JavaScript</li>
    <li>Mysql</li>
    <li>Linux</li>
    <li>Apache</li>
    <li>Средства разработки</li>
    <li>Другие знания</li>
</ul>
Проект является проектом с отрытом исходным кодом, который можно найти <a href="https://github.com/gulkinnos/gulkinnos.ru" title="Перейти в репозиторий проекта" rel="nofollow" target="_blank">в моём репозитории на gitHub</a>.<br>
Любой желающий может присоединиться к работе над проектом на добровольной основе.<br>
Принимаются любые критические замечания и конктретные предложения в области внешнего вида сайта, структуры движка, безопасности сервера, настроек PHP и MYSQL, наполнения контентом, добавления различных плюшек и т.д. и т.п..<br>
<br>
Проект создается в качестве хобби без отрыва от производства.
<br>
Проект стартовал на сервере 18 марта 2017 года.
</p>

