<h1><?= $headTitle ?></h1>
<p>
<ul>Как создавался проект
    <li>декабрь 2016.<br>
        Родилась идея проекта.<br>
        Появилась необходимость размещения в сети некоторых скриптов, заметок и наработок.</li>
    <li>январь 2017.<br> Проект заглох из-за большого количества прогалов в познаниях.<br>
        Начался поиск ответов.</li>
    <li>февраль 2017.<br> Найдены некоторые ответы.<br>
        Зарегистрирован домен, арендован сервер.<br>
        Настроена среда разработки. </li>
    <li>март 2017.<br> Проект переносится на бумагу.<br>
        Описана структура проекта, основные идеи и страницы.<br>
        Решен вопрос с переделкой проекта на структуру с mod_rewrite.<br>
        Добавлен bootstrap.<br>
        Добавлен общий фрейм (заголовки в head и меню).<br>
        Появляются первые страницы проекта. Проект открывается на github.com.<br>
        Появляется список задач проекта в трекере задач github.<br>
        Становится понятно, что работы предстоит много и есть много вопросов без ответов. Приглашены первые соразработчики.<br>
        Начинается добавление основных страниц проекта.<br>
        Появляется страница с <a href="/howToJoin/">инструкцией</a> по присоединению к работе над проектом. 
    </li>
</ul>
</p>

