

<h1>
    Это главная страница проекта gulkinnos.ru
</h1>
<p>
    Добро пожаловать на проект gulkinnos.ru.
   <br>
   Этот проект создаётся в качестве хобби автора и существует исключительно на средства автора.
   <br>
   Здесь никогда не будет рекламы и вредоносного контента.
   <br>
   Пощёлкайте по меню. Может быть Вас что-то заитересует.
   <br>
   Проект находится в стадии разрабоки, так что здесь не очень много контента.
   <br>
   Сейчас я работаю над наполнением сайта достойной информацией, которая поможет начинающим разработчикам изучить мир веб-разработки.
   <br>
   Скоро здесь будут материалы о том, как создавать собственный сайт, что делать в linux терминале, как использовать MySQL и PHP.
   <br>
   <br>
   .. Продолжение следует
</p>
<?php

